{
  "﻿Banner\nCareers\nBe a part of a team that's constantly innovating and pushing boundaries.\n\nWork with us\nJoin our team of online marketing all-stars!\nWe're a digital marketing company that's always on the lookout for talented individuals to join our team. If you're passionate about online marketing and want to help us take our company to the next level, we'd love to hear from you! We offer a fun and collaborative work environment with plenty of opportunities for career growth.\n\n\nCurrent openings\nExplore our open positions and find the perfect fit for you\n\nDigital Marketing Intern\n0-6 months experience\nFull time\nGurugram\n\nBackend Developer\n2+ years’ experience\nFull time\nGurugram\n\nManager – Marketing\n2-5 years’ experience\nFull time\nGurugram\n\nJob description\nDigital Marketing Intern\nAbout this role\nAs an Intern, Digital Marketing, you will be responsible to assist us in scaling our marketing efforts geared toward growing profitable E-commerce revenue. An ideal team member should have exceptional skills in planning and executing strategies and thrive working cross functionally with internal and external stakeholders.\nKey responsibilities\n    • Conducting end-to-end execution, monitoring, measurement, reporting, and optimization of AdWords (Search) campaign\n    • Keep pace with search engine and PPC industry trends and developments\n    • Generate weekly, monthly, and quarterly progress reports of the campaigns aligned with the OKR’s and for setting new key results\n    • Support the generation of new paid search campaigns, ad groups, and accounts and help in the creation of new paid search marketing initiatives\n    • Communicating with the team on campaigns development, timelines, and results for effective implementation.\nSkills\n    • High level of organization and attention to detail\n    • Excellent and professional verbal and written communication skills\n    • Ability to analyze data and be a creative problem solver – analytical thinkers preferred\n    • Ability to work and adapt in a fast-paced, innovative, deadline-driven environment\n    • Positive attitude, strong business acumen, accountability and personally motivated\n    • Ability to retain information and learn quickly\n    • Able to give and receive constructive feedback and embrace change\n    • Eagerness to learn and grow professionally\n    • Ability to collaborate and thrive in a team culture\n    • Moderate to advance Excel experience (Pivot table, graphs)\nEducational qualification\n    • Bachelor’s degree in marketing / business administration or similar field\nExperience\n    • 0-6 months of proven experience in managing Google ads campaigns\n    • Should be comfortable with working in night shifts\n\nJob description\nBackend Developer\nAbout this role\nWe’re looking for an enthusiastic Backend Developer to create and deliver outstanding experiences for users and help implement improvements to existing codebase.\nKey responsibilities\n    • Collaborate with teams to develop and design amazing web solutions.\n    • Deployment of multiple webapps on a production level.\n    • Testing and debugging on an individual and team level.\n    • Using latest JS technologies to develop multiple websites.\n    • Maintaining and updating the codebase to provide the smooth User Experience.\n    • Designing Innovative Solutions for multiple ecommerce problem statements.\n    • Knowledge of software engineering best practices across the development lifecycle including agile methodologies, coding standards, code reviews, source management, build processes, testing and operations.\n    • Strong analytical and problem-solving skills paired with the ability to develop creative and efficient solutions.\n    • Knowledge of Cloud Architecture is a plus. (AWS, Google Cloud and Digital Cloud)\nEducational qualification\n    • Bachelors in Technology or any other relevant field.\nExperience\n    • 2+ years of experience working as a Software Engineer.\n    • Experience building maintainable and testable code bases, including experience writing tests.\n    • Experience building solutions that integrate multiple components and/or services (Cloud services and APIs).\n    • Experience building and consuming APIs. Experience working with PHP, and familiarity with modern OOP paradigm overall and common software design patterns.\n    • Willingness to learn (or experience with) PHP and JavaScript, and related frameworks.\n    • Experience working under Agile-based development cycles and processes.\nAdditional preferred skills\n    • Experience with cloud computing environments/architectures/services (AWS preferable)\n    • Experience with security and networking implication and best practices within the SDLC\n\n\nJob description\nManager - Marketing\nAbout this role\nKhojdeal is seeking a Marketing Manager who will oversee the promotion of our organization’s brands. As the right talent, you will be responsible for identifying new clients supporting lead generation efforts and promoting our organization using different marketing strategies. You will also be tasked with developing budgets and expenditures, as well as R&D appropriations along with developing and managing our company's advertising campaigns.\nKey responsibilities\n    • Build marketing programs to support specific marketing objectives across different channels in support of our overall strategic marketing plan.\n    • Lead the execution of marketing programs from start to finish, driving collaboration with the stakeholders and leveraging the right internal processes.\n    • Work with the other marketing teams, other internal stakeholders, and external agencies and vendors.\n    • Experiment with a variety of organic and paid acquisition channels –, pay per click campaigns, event management, publicity, social media, lead generation campaigns, copywriting, performance analysis, and much more.\n    • Produce valuable and engaging content for our website and blog that attracts and converts our target groups.\n    • Create, maintain, and conduct analytics reporting across multiple platforms and extract key insights for future campaign development and go-to-market strategies, complete with formal proposals and recommendations on tactics.\n    • Build strategic relationships and partner with key industry players, agencies, and vendors.\n    • Workload and Workforce planning for the Marketing team for the efficient growth of the team.\n    • Oversee marketing budget and allocate/invest funds wisely.\n    • Generate the revenue generation streams by adopting the horizontal scaling model.\n    • Measure and report performance of marketing campaigns, gain insight and assess against objectives and key results. \nSkills\n    • Understanding of public relations\n    • Advanced communication skills\n    • Strong project management skills\n    • Solid analytical and critical thinking skills\n    • Strong communication and interpersonal skills\n    • Robust leadership, planning, and execution skills\n    • Ability to working in a fast-paced environment\n    • Proficiency in computer skills, Microsoft Office Suite (Word, PowerPoint, and Excel) \n    • Ability to manage and lead the marketing team \nEducational Qualification\n    • Bachelor’s/Master’s degree in marketing is preferred\nExperience Requirements\n    • 2-5 years of proven experience in marketing or similar role is preferred.\n    • Experience with B2C social media, Google AdWords, email campaigns and SEO/SEM.\n    • Experience with creating a marketing campaign, marketing strategy, and marketing plan.\n    • Experience with online marketing, including social media, and content marketing.\n\n\nContent common in all JDs\nWho we are?\nWe're a digital marketing company that prides itself on being different.  We don't rely on a one-size-fits-all approach to marketing – instead, we create bespoke campaigns that are tailored to our clients' individual needs.\nWhat makes Pixel Pay Media a great place to work?\nOur team is our biggest asset. We have a group of highly talented and experienced professionals who are passionate about what they do. We're also a close-knit team, so there's a great sense of camaraderie among everyone who works here. We all work together to create the best possible campaigns for our clients, and we have a lot of fun doing it.\n\n\nApply now\nIf you think you've got what it takes, then we'd love to hear from you. Send us your CV and a cover letter explaining why you want to work with us, and we'll take it from there.": null
}
